## Loading and Saving to External files

In [1]:
import numpy as np
import pandas as pd

In [5]:
# we can save any structure like this
arr = np.arange(10)
arr
np.save('my_array', arr) # this will persist in the file system
# we can also use savez to save as a compressed file

In [6]:
# read back
arr2 = np.load('my_array.npy') # numpy handles all the file access
arr2

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [17]:
# we can save comma separated values (csv)
np.random.seed(20) # this ensures reproduicible random numbers
r = np.arange(10)
np.random.shuffle(r) # put the members into a random order
r
np.savetxt('my_arr.csv', r, delimiter=',') # create csv file

In [18]:
d = np.loadtxt('my_arr.csv')
d

array([7., 1., 8., 5., 0., 2., 6., 9., 4., 3.])

### Loading Large CSV data

In [22]:
# we can load data from very large data sets (limited only by resources)
df = pd.read_csv('data/salaries.csv') # make sure the file is accessable to this notebook
df.head()
df.tail()
# we cana quickly grasp some useful statistical values
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [35]:
# we can explore this dataframe
df.columns
df.size # total number of data points
df.sum()
df.max() # or df.min()
df['salary'].mean()
df['phd']

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

### Grouping and Aggregating data

In [37]:
# grouping data
df_grouped = df.groupby(['discipline','rank'])
df_grouped = df.groupby(['rank', 'discipline']) # the order matters
# we now havea  group object
df_grouped.count()

                      phd  service  sex  salary
rank      discipline
AssocProf A             5        5    5       5
          B             8        8    8       8
AsstProf  A             8        8    8       8
          B            11       11   11      11
Prof      A            23       23   23      23
          B            23       23   23      23

In [42]:
df_rank = df.groupby(['rank', 'sex']) # this is a group object
df_rank.max() # or min, mean etc.

                 discipline  phd  service  salary
rank      sex
AssocProf Female          B   26       24  109650
          Male            B   20       17  119800
AsstProf  Female          B   11        6   97032
          Male            B    8        4   92000
Prof      Female          B   39       36  161101
          Male            B   56       51  186960

In [45]:
# min-challenge: show the mean salary for each rank
df_mean_salary = df.groupby(['rank'])
df_mean_salary.mean()
# now show mean salary where salary exceeds 120000
df_subset = df[ df['salary']>12000 ]
df_subset.groupby(['rank']).mean()

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [52]:
# Aggregating data
df.agg({'rank':['nunique']}) # ery handy to find how many unique members

         rank
nunique     3

In [59]:
# show the minima for all the data showing only 'rank'
col_l = ['phd', 'salary']
stats_l = ['min', 'max', 'mean']
df[col_l].agg(stats_l)

            phd         salary
min    1.000000   57800.000000
max   56.000000  186960.000000
mean  19.705128  108023.782051